[
  {
    "id": "624b233b205ad564ec239087",
    "img": "https://randomuser.me/api/portraits/men/43.jpg",
    "name": "Cindy Duran",
    "review": "I am not a gamer. I go this primarily for its backlit keys. I don't really understand why gamers needs such a pretty keyboard. I think maybe some keys have special purposes for gaming and so are similarly colored. On my keyboard for e.g. keys up, down, left, right are colored differently from all the other keys - purple. The number keys on the number pad are yellow, the operators red, the number keys on the main keyboard are red, the other letters turquoise(? one of those light blues) and the function keys are a bright blue, the home, ins, pg up etc. are green. There are various effects for the lighting which I really dont get the purpose of.",
    "rating": "4"
  },
  {
    "id": "624b233b80adefc621e76a1e",
    "img": "https://randomuser.me/api/portraits/men/8.jpg",
    "name": "Blanche Chandler",
    "review": "This keyboard has cool features and at first I liked it a lot. The volume knob and LEDs are awesome features. The LEDs are really nice and work well. They have a lot of different settings and the brightness is adjustable. That part is great. The keys are the problem. The problem is that the design of the keys is like a square as opposed to a standard beveled key. This throws your tactile sense off and you can easily hit several keys when typing fast. That makes it VERY difficult to type quickly. I work and play games on my PC and I was making a ton of mistakes using this keyboard. Using the was not possible and I just had to order a different one. I will give this one to my 6 YO son who loves the LEDs. It's possible you can buy a different set of keys for this thing. It does come with a key puller. Who knows.",
    "rating": "5"
  },
  {
    "id": "624b233bdc0b93f84ed46a2d",
    "img": "https://randomuser.me/api/portraits/men/78.jpg",
    "name": "Erin Sharpe",
    "review": "I bought one of these keyboards on December 14th 2020. I initially loved it so much that I purchased another on December 30th 2020. It's now March of 2021 and both of my keyboards are a complete mess.The first keyboard got a bit sticky on a key so we tried taking it apart to clean. The pieces are so hard to put back together that we've given up on that keyboard. The second keyboard was used heavily for gaming. Several keys, especially my make an insanely loud squeaky spring noise when pressed. ITS ONLY BEEN A FEW MONTHS OF USE!!! My initial impression of this being a quality keyboard are gone. I cannot emphasize enough how awful this keyboard sounds after only a few months of use",
    "rating": "3"
  },
  {
    "id": "624b233b84a991449e46b08f",
    "img": "https://randomuser.me/api/portraits/men/96.jpg",
    "name": "Frank Salinas",
    "review": "I was looking for a mechanical keyboard because I simply like the physical response better than membrane keyboards. My previous (primary) keyboard was a membrane keyboard  style with strong reflex response. I can safely say that this keyboard key response is exactly what I was looking for. I did my homework of course and deliberated for several weeks, because I intended to purchase something I would be satisfied with. The black key response is perfect for my purposes because the majority of what I need it for is office work, with the occasional gaming. Soft touch with just the right amount of minimal resistance. If you're like me in this regard, I think this keyboard is the perfect fit. Sound:It is definitely, like you would expect a mechanical keyboard to be. I personally like this as it gives you an audible response to your input. It isn't overly loud, just responsive and audible.",
    "rating": "4"
  },
  {
    "id": "624b233b1bd50cc0d8f0f41d",
    "img": "https://randomuser.me/api/portraits/women/29.jpg",
    "name": "Marla Page",
    "review": "The lights and the volume control are really nice. The springs are way too soft, and the stroke is way too much on the keys. I have used everything from IBM mechanical to membrane. I am a fairly fast touch-typist, and this keyboard really slows me down. It repeats letters. It sometimes registers before a key is fully pressed. The stroke is so long that I don't lift my fingers high enough and end up running into the sides of other keys. Honestly it reminds me of typing on a mechanical typewriter -- you have to lift your fingers that much -- but the springs are so soft that you have to rest your fingers very lightly on the keys or you might register a letter you don't want.",
    "rating": "5"
  },
  {
    "id": "624b233be300e05b2ae73cf5",
    "img": "https://randomuser.me/api/portraits/men/14.jpg",
    "name": "Meredith Barron",
    "review": "There are so many options of personal LED/setting options for color and actions. However, the biggest downfall is it is equivalent to old typewriter keys. You constantly have a problem of fat fingering if you are a fast which results in a constant repetitive deleting/repeat attempt if you don't hit the keys 100%. Being a gamer and a writer, the only reason I'm keeping this keyboard is because; 1. It functions, does it's job; 2. the settings are really nice and very ranged for anyone who likes lights with their keyboard, you will have it all; 3. You just have to deal with the annoyance of getting used to fat fingering keys and people around you asking what book you're writing (which I am currently doing but can't do it when others want me to shut my keyboard up because it clicks every split second).",
    "rating": "4"
  }
]
